{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "UNet2DConditionModel",
    "parent_library": "diffusers.models.unets.unet_2d_condition"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.0",
  "qalora_group_size": 16,
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "up_blocks.1.attentions.0.transformer_blocks.0.attn2.to_out.0",
    "up_blocks.1.attentions.1.transformer_blocks.0.attn2.to_q",
    "3.attentions.0.transformer_blocks.0.attn2.to_out.0",
    "3.attentions.1.transformer_blocks.0.attn2.to_out.0",
    "up_blocks.1.attentions.1.transformer_blocks.0.attn2.to_v",
    "up_blocks.2.attentions.1.transformer_blocks.0.attn2.to_q",
    "2.transformer_blocks.0.attn2.to_out.0",
    "3.attentions.1.transformer_blocks.0.attn2.to_k",
    "up_blocks.2.attentions.0.transformer_blocks.0.attn2.to_k",
    "3.attentions.0.transformer_blocks.0.attn2.to_k",
    "3.attentions.0.transformer_blocks.0.attn2.to_v",
    "up_blocks.2.attentions.0.transformer_blocks.0.attn2.to_out.0",
    "up_blocks.2.attentions.0.transformer_blocks.0.attn2.to_q",
    "3.attentions.1.transformer_blocks.0.attn2.to_v",
    "up_blocks.1.attentions.0.transformer_blocks.0.attn2.to_k",
    "3.attentions.1.transformer_blocks.0.attn2.to_q",
    "up_blocks.1.attentions.0.transformer_blocks.0.attn2.to_v",
    "2.transformer_blocks.0.attn2.to_q",
    "2.transformer_blocks.0.attn2.to_v",
    "up_blocks.2.attentions.1.transformer_blocks.0.attn2.to_k",
    "3.attentions.0.transformer_blocks.0.attn2.to_q",
    "up_blocks.1.attentions.1.transformer_blocks.0.attn2.to_k",
    "2.transformer_blocks.0.attn2.to_k",
    "up_blocks.1.attentions.1.transformer_blocks.0.attn2.to_out.0",
    "up_blocks.1.attentions.0.transformer_blocks.0.attn2.to_q",
    "up_blocks.2.attentions.1.transformer_blocks.0.attn2.to_v",
    "up_blocks.2.attentions.0.transformer_blocks.0.attn2.to_v",
    "up_blocks.2.attentions.1.transformer_blocks.0.attn2.to_out.0"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}